<script setup lang="ts">
import trial4 from './trial4.vue';
</script>

<template>
    <div class="instr-box">
        <p>您需要对给出的词语进行维度评分，在实验中您会看到以下问题：</p>
        <div class="exper-box">
            <trial4 title="【词语】可以用于描述某个人的【维度】"
                    desc="维度定义"
                    optionLabelMin="非常不同意"
                    optionLabelMax="非常同意"
                    :view="true"></trial4>
        </div>
        <p>其中【维度】包括能力、道德、社交能力、外貌和社会经济地位五个维度中的一个，您需要对该段描述进行1-9分的评分，其中1分表示非常不同意，9分表示非常同意。评分采用鼠标选择相应数字进行评分，在每次评分后请按“空格键”继续。</p>
        <p>其中：</p>
        <p>道德：用于描述人的道德品格或道德品质（包括积极与消极）</p>
        <p>能力：用于描述人可用来完成某一项目标或者任务的综合素质（这里的目标和任务不包括人际交往）</p>
        <p>社交能力：用于描述人的人际交往能力</p>
        <p>外貌：用于描述人的长相、身材等</p>
        <p>社会经济地位：用于描述人的社会地位和经济水平等</p>
        <p><strong>请注意：</strong>词语可能是积极词，也可能是消极词，请您不要根据积极和消极进行评分，而是依据该词是否适合用来描述该维度进行评分。</p>
        <p>举个例子：“强盗”这个词，看到之后通常会想到“用暴力抢夺他人财物的人”，这时，虽然该词为消极词，但它是用来描述某人的道德水平低，因此对“【强盗】可以用于描述某个人的【道德】”这一问题的评分通常为8分或9分。而“拘泥”这个词，有的人看到后可能会想到它的动词含义，即“不懂得变通”，所以在“【拘泥】可以用于描述某个人的【能力】”这一问题上偏向于同意，即评分在7分以上；而有的人可能会联想到它的形容词含义，即“拘束,不自然”，所以他们认为这个词并不适合用来描述能力，即评分在3分以下；还有的人可能觉得这个词既可以描述，又不可以描述，那么此时的评分通常在5分左右。</p>
        <p><strong>因此，看到词汇的感受是因人而异的，没有对错之分，在评定的时候依据自己的第一感觉即可。</strong></p>
        <p>如果您已经明白本研究的任务，请按 <strong>空格键</strong> 开始实验。</p>
    </div>
</template>

<style scoped>
.exper-box {
    width: 460px;
    height: 220px;
    transform-origin: top;
    transform: scale(0.5, 0.5);
}

.instr-box > p {
    text-indent: 2em;
}
.instr-box > div {
    text-align: center;
}
</style>